#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <math.h>
int main() {
	setlocale(LC_ALL, "Rus");
	float x, y, sum = 0;//задаем переменные 
	printf("\nПеременная должна быть целочисленная и не являтся 0!\n\nЕсли вы введете буквы или символ то программа выдаст ошибку!\n\n-----------------------------------------------------------\n\nВведите переменную X:");
	while (!scanf("%f", &x) || x == 0) {//делаем защиту от дурака 
		while (getchar() != '\n');
		printf("\n\n-----------------------------------------------------------\n\nОшибка ввода\n\nВведите переменную X:");
	}
	for (int a = 10, b = 11; a, b >= 1; a--, b--) { //Вводим цикыл главной формулы 
		y = b * pow(x, a);
		sum = sum + y;
	}
	printf("\n\n-----------------------------------------------------------\n\nПолученный результат в ходе вычислениий: \n\n1) 11 * %f^10 + 10 * %f^9 + 9 * %f^8 + 8 * %f^7 + 7 * %f^6 + 6 * %f^5 + >>\n\n2) >> + 5 * %f^4 + 4 * %f^3 + 3 * %f^2 + 2 * %f + 1 = %f\n\n", x, x, x, x, x, x, x, x, x, x, sum);
	return 0;
}